vim.loader.enable()

require("core.lazy")
require("core.config")
require("core.autocmds")
require("core.utils")
require("core.mappings")
require("core.ru_mappings")

--[[
В данном файле происходит инициализация файлов конфигурации.
Добавлять расширения из папки "plugins" не требуется, так как в используемой структуре конфигурации этим занимается "Lazy.nvim".
Указывать расширение ".lua" для файлов и папку "lua" не нужно, так как NeoVim определяет их автоматически.
Вместо require("папка.файл") можно использовать require("папка/файл"), если вам так удобнее.
Учтите, что порядок подключения имеет значение! (Например, если вы попытаетесь активировать тему до её загрузки, будет выдана ошибка!)
--]]
