require("mason").setup{
    -- Настройка внешнего вида
    ui = {
        border = { "╭", "─", "╮", "│", "╯", "─", "╰", "│" }, -- рамка для окна
    },
    -- Настройка сочетаний клавиш
    keymaps = {
                toggle_package_expand = "<CR>", -- Раскрыть пакет
                install_package = "i", -- Установить пакет, на котором находится курсор
                update_package = "u", -- Переустановить/обновить пакет, на котором находится курсор
                check_package_version = "c",  -- Проверить наличие новой версии для пакета, на котором находится курсор
                update_all_packages = "U", -- Обновить все установленные пакеты
                check_outdated_packages = "C", -- Проверить наличие новой версии для всех установленных пакетов
                uninstall_package = "X", -- Удалить пакет, на котором находится курсор
                cancel_installation = "<C-c>", -- Отменить установку пакета, на котором находится курсор
                apply_language_filter = "<C-f>", -- Применить языковую фильтрацию
                toggle_package_install_log = "<CR>", -- Открыть/Закрыть журнал установки пакета, на котором находится курсор
                toggle_help = "g?", -- Открыть меню помощи
    },
}

require("mason-lspconfig").setup {
    --[[
    Список языковых серверов для автоматической установки, если они ещё не установлены
    Можно указывать конкретную версию, например, pyright@1.1.339
    --]]
    ensure_installed = { "pyright", "lua_ls" },
    automatic_installation = true, -- Автоматическая установка
    handlers = nil,
}
