require'nvim-treesitter.configs'.setup {
    -- Список нужных парсеров (первые 5 парсеров обязательно должны быть установлены)
    ensure_installed = { "c", "lua", "vim", "vimdoc", "query", "python" },

    -- Способ установки парсеров (синхронный или асинхронный)
    sync_install = false, -- Включаем асинхронную установку парсеров
    -- sync_install = true, -- Включаем синхронную установку парсеров

    -- Автоматически устанавливать недостающие парсеры при входе в буфер
    auto_install = true,

    -- Список парсеров, которые следует игнорировать при установке
    -- ignore_install = { "javascript" }, -- Пример

    -- Настрока подсветки синтаксиса
    highlight = {
        enable = true, -- Активировать подсветку

        -- Список языков, для которых будут отключена подсветка (указываются названия парсеров, а не тип файла)
        -- disable = { "c", "rust" },

        -- Установите для этого параметра значение true, если вы зависите от включения синтаксиса (например, для отступов)
        -- В теории, использование этой опции может замедлить работу NeoVim и добавить некоторые проблемы
        -- Вместо true это также может быть список языков
        additional_vim_regex_highlighting = true,
    },
}
