require("trouble").setup {
    position = "bottom", -- Позиция списка: bottom(внизу), top(вверху), left(слева), right(справа)
    height = 10, -- Высота списка, когда позиция top(вверху) или bottom(внизу)
    width = 50, -- Ширина списка, когда позиция left(слева) или right(справа)
    icons = true, -- Использовать devicons
    mode = "workspace_diagnostics", -- Режим работы: "workspace_diagnostics", "document_diagnostics", "quickfix", "lsp_references", "loclist"
    severity = nil, -- Типы диагностических данных (по умолчанию все)
    fold_open = "▾", -- Значок, используемый для открытых складок
    fold_closed = "▸", -- Значок, используемый для закрытых складок
    group = true, -- Группировать результаты по файлам
    padding = true, -- Добавить дополнительную новую строку вверху списка
    cycle_results = false, -- Циклический список элементов при достижении начала или конца списка

    -- Сопоставления клавиш для действий в списке
    action_keys = {
        -- Передайте параметру {}, чтобы удалить сопоставление, например:
        -- close = {},
        close = "q", -- Закрыть список
        cancel = "<esc>", -- Отмените предварительный просмотр и вернитесь к последнему окну/буферу/курсору
        refresh = "r", -- Обновить данные вручную
        jump = { "<cr>", "<tab>", "<2-leftmouse>" }, -- Перейти к диагностике или открыть/закрыть складки
        open_split = {}, -- Открыть буфер в новом разделённом окне
        open_vsplit = {}, -- Открыть буфер в новом вертикально разделённом окне
        open_tab = {}, -- Открыть буфер в новой вкладке
        jump_close = {"g"}, -- Перейти к диагностике и закрыть список
        toggle_mode = "m", -- Переключение между режимами диагностики "workspace" и "document" (ошибки по всему активному каталогу или только по активному файлу)
        switch_severity = "f", -- Переключатель «диагностики» между ALL/HINT/INFO/WARN/ERROR
        toggle_preview = "P", -- Переключить автоматический предварительный просмотр (включено/выключено)
        hover = "K", -- Открывает небольшое всплывающее окно с полным многострочным сообщением
        preview = "p", -- Просмотреть место диагностики
        open_code_href = "c", -- Дополнительная информация о диагностической ошибке (если присутствует)
        close_folds = {"zM", "zm"}, -- Закрыть все складки
        open_folds = {"zR", "zr"}, -- Открыть все складки
        toggle_fold = {"zA", "za"}, -- Переключить сворачивание текущего файла
        previous = "k", -- Предыдущий элемент
        next = "j", -- Следующий элемент
        help = {}, -- Меню помощи
    },
    multiline = true, -- Отображать многострочные сообщения
    indent_lines = true, -- Добавьте направляющую отступа под значками сгиба
    win_config = { border = "single" }, -- Конфигурация для плавающих окон
    auto_open = false, -- Автоматически открывать список, когда у вас есть диагностика
    auto_close = false, -- Автоматически закрывать список, когда у вас нет диагностики
    auto_preview = true, -- Автоматически просматривать местоположение диагностики. <esc> для закрытия предварительного просмотра + вернуться к последнему окну
    auto_fold = false, -- Автоматически сворачивать список проблем с файлами при создании
    auto_jump = {"lsp_definitions"}, -- Автоматически переходить, если есть только один результат для данных режимов
    include_declaration = { "lsp_references", "lsp_implementations", "lsp_definitions"  }, -- Для заданных режимов включать в результаты объявление текущего символа
    signs = {
      -- Значки для отображаемой диагностики
      error = "󰅙 ",
      warning = " ",
      hint = "",
      information = "",
      other = " ",
    },
    use_diagnostic_signs = false -- Исп. знаки, определенные в lsp-клиенте
}
